#+TITLE: Biostatistics and data analysis for science
#+AUTHOR: Njagi Mwaniki
#+OPTIONS: date:nil

#+LATEX: \newpage


**** Example
  Paired t-test on the effectiveness of a weight loss drug.

  #+CAPTION: Positive values indicate weight loss and negative values indicate weight gain
   | subject | on drug | on placebo |  d_i |
   |---------+---------+------------+------|
   |       1 |     1.1 |          0 |  1.1 |
   |       2 |     1.3 |       -0.3 |  1.6 |
   |       3 |     1.0 |        0.6 |  0.4 |
   |       4 |     1.7 |        0.3 |  1.4 |
   |       5 |     1.4 |        0.7 |  0.7 |
   |       6 |     0.1 |       -0.2 |  0.3 |
   |       7 |     0.5 |        0.6 | -0.1 |
   |       8 |     1.6 |        0.9 |  0.7 |
   |       9 |    -0.5 |       -2.0 |  1.5 |
   |---------+---------+------------+------|
   |         |         |            |  7.6 |
   #+TBLFM: $4=vsum(@2$4..@10$4)


   - H_0 :: The given weight loss drug has no effect on weight loss.
   - H_1 :: The given weight loss drug leads to weight loss.
   - \alpha :: 0.05 (threshold for whether to accept H_0).
   - d_i :: difference between measurements of each subject
   - \mu_d :: mean difference between the measurements of each subject, if \mu_d = 0 there's no difference between the two measurements.
   - degrees of freedom (df) :: n - 1

\begin{align*}
\mu_d = \dfrac{\Sigma{d_i}}{n} = \dfrac{7.6}{9} = 0.8444
 
s = 0.72

n = 9
\bar x = 0.8

H_0 = 0  \tiny \textbf{ null hypothesis is always 0}

df = n - 1 = 9 - 1= 8

t* = \dfrac{1.0 - 0}{\dfrac{0.72}{\sqrt{9}}} = 4.17

p = 0.005

\end{align*}

